Revit 2027 API
PointOnPlane.IsValidPlaneReference Method
Check whether a geometry reference corresponds to a referenceable plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidPlaneReference(
	Document doc,
	Reference planeReference
)
Public Shared Function IsValidPlaneReference (
	doc As Document,
	planeReference As Reference
) As Boolean
public:
static bool IsValidPlaneReference(
	Document^ doc,
	Reference^ planeReference
)
static member IsValidPlaneReference :
        doc : Document *
        planeReference : Reference -> bool
Parameters
doc Document
planeReference Reference
Return Value
Boolean
Remarks
Valid plane references include: planar faces of solids; the PlaneReference properties of Level and SketchPlane; the Reference property of ReferencePlane.
See Also
Reference
PointOnPlane Class
Autodesk.Revit.DB Namespace